# ####################################################################

#  Created by Genus(TM) Synthesis Solution 16.22-s033_1 on Mon Dec 11 21:04:34 -0500 2017

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design mkPE32

create_clock -name "clk" -add -period 10.0 -waveform {0.0 5.0} [get_ports CLK]
set_clock_transition 0.1 [get_clocks clk]
set_load -pin_load 0.005 [get_ports RDY_load_weights]
set_load -pin_load 0.005 [get_ports RDY_add_input]
set_load -pin_load 0.005 [get_ports RDY_multiply_constants]
set_load -pin_load 0.005 [get_ports RDY_combine]
set_load -pin_load 0.005 [get_ports RDY_add_constant]
set_load -pin_load 0.005 [get_ports RDY_nonlinearity]
set_load -pin_load 0.005 [get_ports {get_pos_partial_sum[7]}]
set_load -pin_load 0.005 [get_ports {get_pos_partial_sum[6]}]
set_load -pin_load 0.005 [get_ports {get_pos_partial_sum[5]}]
set_load -pin_load 0.005 [get_ports {get_pos_partial_sum[4]}]
set_load -pin_load 0.005 [get_ports {get_pos_partial_sum[3]}]
set_load -pin_load 0.005 [get_ports {get_pos_partial_sum[2]}]
set_load -pin_load 0.005 [get_ports {get_pos_partial_sum[1]}]
set_load -pin_load 0.005 [get_ports {get_pos_partial_sum[0]}]
set_load -pin_load 0.005 [get_ports RDY_get_pos_partial_sum]
set_load -pin_load 0.005 [get_ports {get_neg_partial_sum[7]}]
set_load -pin_load 0.005 [get_ports {get_neg_partial_sum[6]}]
set_load -pin_load 0.005 [get_ports {get_neg_partial_sum[5]}]
set_load -pin_load 0.005 [get_ports {get_neg_partial_sum[4]}]
set_load -pin_load 0.005 [get_ports {get_neg_partial_sum[3]}]
set_load -pin_load 0.005 [get_ports {get_neg_partial_sum[2]}]
set_load -pin_load 0.005 [get_ports {get_neg_partial_sum[1]}]
set_load -pin_load 0.005 [get_ports {get_neg_partial_sum[0]}]
set_load -pin_load 0.005 [get_ports RDY_get_neg_partial_sum]
set_load -pin_load 0.005 [get_ports {read_weights[15]}]
set_load -pin_load 0.005 [get_ports {read_weights[14]}]
set_load -pin_load 0.005 [get_ports {read_weights[13]}]
set_load -pin_load 0.005 [get_ports {read_weights[12]}]
set_load -pin_load 0.005 [get_ports {read_weights[11]}]
set_load -pin_load 0.005 [get_ports {read_weights[10]}]
set_load -pin_load 0.005 [get_ports {read_weights[9]}]
set_load -pin_load 0.005 [get_ports {read_weights[8]}]
set_load -pin_load 0.005 [get_ports {read_weights[7]}]
set_load -pin_load 0.005 [get_ports {read_weights[6]}]
set_load -pin_load 0.005 [get_ports {read_weights[5]}]
set_load -pin_load 0.005 [get_ports {read_weights[4]}]
set_load -pin_load 0.005 [get_ports {read_weights[3]}]
set_load -pin_load 0.005 [get_ports {read_weights[2]}]
set_load -pin_load 0.005 [get_ports {read_weights[1]}]
set_load -pin_load 0.005 [get_ports {read_weights[0]}]
set_load -pin_load 0.005 [get_ports RDY_read_weights]
set_load -pin_load 0.005 [get_ports is_ready]
set_load -pin_load 0.005 [get_ports RDY_is_ready]
set_load -pin_load 0.005 [get_ports RDY_reset_pe]
group_path -name cg_enable_group_clk -through [list \
  [get_pins RC_CG_HIER_INST0/enable]  \
  [get_pins RC_CG_HIER_INST1/enable]  \
  [get_pins RC_CG_HIER_INST2/enable]  \
  [get_pins RC_CG_HIER_INST3/enable]  \
  [get_pins RC_CG_HIER_INST0/enable]  \
  [get_pins RC_CG_HIER_INST1/enable]  \
  [get_pins RC_CG_HIER_INST2/enable]  \
  [get_pins RC_CG_HIER_INST3/enable] ]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports RST_N]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {load_weights_weights[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports EN_load_weights]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_input_inp[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_input_inp[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_input_inp[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_input_inp[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_input_inp[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_input_inp[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_input_inp[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_input_inp[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports EN_add_input]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_pos_constant[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_pos_constant[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_pos_constant[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_pos_constant[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_pos_constant[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_pos_constant[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_pos_constant[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_pos_constant[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_neg_constant[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_neg_constant[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_neg_constant[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_neg_constant[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_neg_constant[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_neg_constant[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_neg_constant[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {multiply_constants_neg_constant[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports EN_multiply_constants]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports EN_combine]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_constant_constant[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_constant_constant[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_constant_constant[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_constant_constant[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_constant_constant[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_constant_constant[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_constant_constant[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {add_constant_constant[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports EN_add_constant]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports EN_nonlinearity]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports EN_get_pos_partial_sum]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports EN_get_neg_partial_sum]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports EN_read_weights]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports EN_is_ready]
set_input_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports EN_reset_pe]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports RST_N]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {load_weights_weights[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports EN_load_weights]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_input_inp[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_input_inp[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_input_inp[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_input_inp[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_input_inp[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_input_inp[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_input_inp[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_input_inp[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports EN_add_input]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_pos_constant[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_pos_constant[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_pos_constant[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_pos_constant[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_pos_constant[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_pos_constant[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_pos_constant[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_pos_constant[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_neg_constant[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_neg_constant[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_neg_constant[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_neg_constant[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_neg_constant[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_neg_constant[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_neg_constant[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {multiply_constants_neg_constant[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports EN_multiply_constants]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports EN_combine]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_constant_constant[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_constant_constant[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_constant_constant[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_constant_constant[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_constant_constant[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_constant_constant[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_constant_constant[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {add_constant_constant[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports EN_add_constant]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports EN_nonlinearity]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports EN_get_pos_partial_sum]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports EN_get_neg_partial_sum]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports EN_read_weights]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports EN_is_ready]
set_input_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports EN_reset_pe]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports RDY_load_weights]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports RDY_add_input]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports RDY_multiply_constants]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports RDY_combine]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports RDY_add_constant]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports RDY_nonlinearity]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_pos_partial_sum[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_pos_partial_sum[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_pos_partial_sum[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_pos_partial_sum[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_pos_partial_sum[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_pos_partial_sum[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_pos_partial_sum[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_pos_partial_sum[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports RDY_get_pos_partial_sum]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_neg_partial_sum[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_neg_partial_sum[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_neg_partial_sum[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_neg_partial_sum[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_neg_partial_sum[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_neg_partial_sum[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_neg_partial_sum[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {get_neg_partial_sum[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports RDY_get_neg_partial_sum]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports {read_weights[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports RDY_read_weights]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports is_ready]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports RDY_is_ready]
set_output_delay -clock [get_clocks clk] -add_delay -min 0.1 [get_ports RDY_reset_pe]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports RDY_load_weights]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports RDY_add_input]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports RDY_multiply_constants]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports RDY_combine]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports RDY_add_constant]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports RDY_nonlinearity]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_pos_partial_sum[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_pos_partial_sum[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_pos_partial_sum[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_pos_partial_sum[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_pos_partial_sum[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_pos_partial_sum[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_pos_partial_sum[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_pos_partial_sum[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports RDY_get_pos_partial_sum]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_neg_partial_sum[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_neg_partial_sum[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_neg_partial_sum[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_neg_partial_sum[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_neg_partial_sum[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_neg_partial_sum[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_neg_partial_sum[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {get_neg_partial_sum[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports RDY_get_neg_partial_sum]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports {read_weights[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports RDY_read_weights]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports is_ready]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports RDY_is_ready]
set_output_delay -clock [get_clocks clk] -add_delay -max 0.1 [get_ports RDY_reset_pe]
set_max_fanout 16.000 [current_design]
set_max_fanout 16.000 [get_ports CLK]
set_max_fanout 16.000 [get_ports RST_N]
set_max_fanout 16.000 [get_ports {load_weights_weights[15]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[14]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[13]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[12]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[11]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[10]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[9]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[8]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[7]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[6]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[5]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[4]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[3]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[2]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[1]}]
set_max_fanout 16.000 [get_ports {load_weights_weights[0]}]
set_max_fanout 16.000 [get_ports EN_load_weights]
set_max_fanout 16.000 [get_ports {add_input_inp[7]}]
set_max_fanout 16.000 [get_ports {add_input_inp[6]}]
set_max_fanout 16.000 [get_ports {add_input_inp[5]}]
set_max_fanout 16.000 [get_ports {add_input_inp[4]}]
set_max_fanout 16.000 [get_ports {add_input_inp[3]}]
set_max_fanout 16.000 [get_ports {add_input_inp[2]}]
set_max_fanout 16.000 [get_ports {add_input_inp[1]}]
set_max_fanout 16.000 [get_ports {add_input_inp[0]}]
set_max_fanout 16.000 [get_ports EN_add_input]
set_max_fanout 16.000 [get_ports {multiply_constants_pos_constant[7]}]
set_max_fanout 16.000 [get_ports {multiply_constants_pos_constant[6]}]
set_max_fanout 16.000 [get_ports {multiply_constants_pos_constant[5]}]
set_max_fanout 16.000 [get_ports {multiply_constants_pos_constant[4]}]
set_max_fanout 16.000 [get_ports {multiply_constants_pos_constant[3]}]
set_max_fanout 16.000 [get_ports {multiply_constants_pos_constant[2]}]
set_max_fanout 16.000 [get_ports {multiply_constants_pos_constant[1]}]
set_max_fanout 16.000 [get_ports {multiply_constants_pos_constant[0]}]
set_max_fanout 16.000 [get_ports {multiply_constants_neg_constant[7]}]
set_max_fanout 16.000 [get_ports {multiply_constants_neg_constant[6]}]
set_max_fanout 16.000 [get_ports {multiply_constants_neg_constant[5]}]
set_max_fanout 16.000 [get_ports {multiply_constants_neg_constant[4]}]
set_max_fanout 16.000 [get_ports {multiply_constants_neg_constant[3]}]
set_max_fanout 16.000 [get_ports {multiply_constants_neg_constant[2]}]
set_max_fanout 16.000 [get_ports {multiply_constants_neg_constant[1]}]
set_max_fanout 16.000 [get_ports {multiply_constants_neg_constant[0]}]
set_max_fanout 16.000 [get_ports EN_multiply_constants]
set_max_fanout 16.000 [get_ports EN_combine]
set_max_fanout 16.000 [get_ports {add_constant_constant[7]}]
set_max_fanout 16.000 [get_ports {add_constant_constant[6]}]
set_max_fanout 16.000 [get_ports {add_constant_constant[5]}]
set_max_fanout 16.000 [get_ports {add_constant_constant[4]}]
set_max_fanout 16.000 [get_ports {add_constant_constant[3]}]
set_max_fanout 16.000 [get_ports {add_constant_constant[2]}]
set_max_fanout 16.000 [get_ports {add_constant_constant[1]}]
set_max_fanout 16.000 [get_ports {add_constant_constant[0]}]
set_max_fanout 16.000 [get_ports EN_add_constant]
set_max_fanout 16.000 [get_ports EN_nonlinearity]
set_max_fanout 16.000 [get_ports EN_get_pos_partial_sum]
set_max_fanout 16.000 [get_ports EN_get_neg_partial_sum]
set_max_fanout 16.000 [get_ports EN_read_weights]
set_max_fanout 16.000 [get_ports EN_is_ready]
set_max_fanout 16.000 [get_ports EN_reset_pe]
set_max_transition 0.1 [current_design]
set_max_dynamic_power 0.0
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports CLK]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports RST_N]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[15]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[14]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[13]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[12]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[11]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[10]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[9]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[8]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[7]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[6]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[5]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[4]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[3]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[2]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[1]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {load_weights_weights[0]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports EN_load_weights]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_input_inp[7]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_input_inp[6]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_input_inp[5]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_input_inp[4]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_input_inp[3]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_input_inp[2]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_input_inp[1]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_input_inp[0]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports EN_add_input]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_pos_constant[7]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_pos_constant[6]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_pos_constant[5]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_pos_constant[4]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_pos_constant[3]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_pos_constant[2]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_pos_constant[1]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_pos_constant[0]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_neg_constant[7]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_neg_constant[6]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_neg_constant[5]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_neg_constant[4]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_neg_constant[3]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_neg_constant[2]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_neg_constant[1]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {multiply_constants_neg_constant[0]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports EN_multiply_constants]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports EN_combine]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_constant_constant[7]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_constant_constant[6]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_constant_constant[5]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_constant_constant[4]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_constant_constant[3]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_constant_constant[2]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_constant_constant[1]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports {add_constant_constant[0]}]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports EN_add_constant]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports EN_nonlinearity]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports EN_get_pos_partial_sum]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports EN_get_neg_partial_sum]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports EN_read_weights]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports EN_is_ready]
set_driving_cell -lib_cell INVD2 -library tcbn65lpwc -pin "ZN" [get_ports EN_reset_pe]
set_wire_load_mode "segmented"
set_wire_load_selection_group "WireAreaForZero" -library "tcbn65lpwc"
set_dont_use [get_lib_cells tcbn65lpwc/BHD]
set_dont_use [get_lib_cells tcbn65lpwc/BUFFD20]
set_dont_use [get_lib_cells tcbn65lpwc/BUFFD24]
set_dont_use [get_lib_cells tcbn65lpwc/BUFTD20]
set_dont_use [get_lib_cells tcbn65lpwc/BUFTD24]
set_dont_use [get_lib_cells tcbn65lpwc/CKBD20]
set_dont_use [get_lib_cells tcbn65lpwc/CKBD24]
set_dont_use [get_lib_cells tcbn65lpwc/CKLHQD20]
set_dont_use [get_lib_cells tcbn65lpwc/CKLHQD24]
set_dont_use [get_lib_cells tcbn65lpwc/CKLNQD20]
set_dont_use [get_lib_cells tcbn65lpwc/CKLNQD24]
set_dont_use [get_lib_cells tcbn65lpwc/CKND20]
set_dont_use [get_lib_cells tcbn65lpwc/CKND24]
set_dont_use [get_lib_cells tcbn65lpwc/GAN2D1]
set_dont_use [get_lib_cells tcbn65lpwc/GAN2D2]
set_dont_use [get_lib_cells tcbn65lpwc/GAOI21D1]
set_dont_use [get_lib_cells tcbn65lpwc/GAOI21D2]
set_dont_use [get_lib_cells tcbn65lpwc/GAOI22D1]
set_dont_use [get_lib_cells tcbn65lpwc/GBUFFD1]
set_dont_use [get_lib_cells tcbn65lpwc/GBUFFD2]
set_dont_use [get_lib_cells tcbn65lpwc/GBUFFD3]
set_dont_use [get_lib_cells tcbn65lpwc/GBUFFD4]
set_dont_use [get_lib_cells tcbn65lpwc/GBUFFD8]
set_dont_use [get_lib_cells tcbn65lpwc/GDCAP]
set_dont_use [get_lib_cells tcbn65lpwc/GDCAP10]
set_dont_use [get_lib_cells tcbn65lpwc/GDCAP2]
set_dont_use [get_lib_cells tcbn65lpwc/GDCAP3]
set_dont_use [get_lib_cells tcbn65lpwc/GDCAP4]
set_dont_use [get_lib_cells tcbn65lpwc/GDFCNQD1]
set_dont_use [get_lib_cells tcbn65lpwc/GDFQD1]
set_dont_use [get_lib_cells tcbn65lpwc/GFILL]
set_dont_use [get_lib_cells tcbn65lpwc/GFILL10]
set_dont_use [get_lib_cells tcbn65lpwc/GFILL2]
set_dont_use [get_lib_cells tcbn65lpwc/GFILL3]
set_dont_use [get_lib_cells tcbn65lpwc/GFILL4]
set_dont_use [get_lib_cells tcbn65lpwc/GINVD1]
set_dont_use [get_lib_cells tcbn65lpwc/GINVD2]
set_dont_use [get_lib_cells tcbn65lpwc/GINVD3]
set_dont_use [get_lib_cells tcbn65lpwc/GINVD4]
set_dont_use [get_lib_cells tcbn65lpwc/GINVD8]
set_dont_use [get_lib_cells tcbn65lpwc/GMUX2D1]
set_dont_use [get_lib_cells tcbn65lpwc/GMUX2D2]
set_dont_use [get_lib_cells tcbn65lpwc/GMUX2ND1]
set_dont_use [get_lib_cells tcbn65lpwc/GMUX2ND2]
set_dont_use [get_lib_cells tcbn65lpwc/GND2D1]
set_dont_use [get_lib_cells tcbn65lpwc/GND2D2]
set_dont_use [get_lib_cells tcbn65lpwc/GND2D3]
set_dont_use [get_lib_cells tcbn65lpwc/GND2D4]
set_dont_use [get_lib_cells tcbn65lpwc/GND3D1]
set_dont_use [get_lib_cells tcbn65lpwc/GND3D2]
set_dont_use [get_lib_cells tcbn65lpwc/GNR2D1]
set_dont_use [get_lib_cells tcbn65lpwc/GNR2D2]
set_dont_use [get_lib_cells tcbn65lpwc/GNR3D1]
set_dont_use [get_lib_cells tcbn65lpwc/GNR3D2]
set_dont_use [get_lib_cells tcbn65lpwc/GOAI21D1]
set_dont_use [get_lib_cells tcbn65lpwc/GOAI21D2]
set_dont_use [get_lib_cells tcbn65lpwc/GOR2D1]
set_dont_use [get_lib_cells tcbn65lpwc/GOR2D2]
set_dont_use [get_lib_cells tcbn65lpwc/GSDFCNQD1]
set_dont_use [get_lib_cells tcbn65lpwc/GTIEH]
set_dont_use [get_lib_cells tcbn65lpwc/GTIEL]
set_dont_use [get_lib_cells tcbn65lpwc/GXNR2D1]
set_dont_use [get_lib_cells tcbn65lpwc/GXNR2D2]
set_dont_use [get_lib_cells tcbn65lpwc/GXOR2D1]
set_dont_use [get_lib_cells tcbn65lpwc/GXOR2D2]
set_dont_use [get_lib_cells tcbn65lpwc/INVD20]
set_dont_use [get_lib_cells tcbn65lpwc/INVD24]
set_clock_latency  0.2 [get_clocks clk]
set_clock_uncertainty -setup 0.1 [get_clocks clk]
set_clock_uncertainty -hold 0.1 [get_clocks clk]
